# 卡方分布

在第 6 讲中，我们已经证明了一个命题：标准正态分布 $X\sim N(0,1)$ ，则 $X^2 \sim Ga(1/2,1/2)$ 。我们将 $Ga(1/2,1/2)$ 命名为卡方分布 $\chi^2(1)$ 。另外，在第 9 讲中，我们也已经证明了一个命题：伽马分布具有可加性。于是，如果 $Y_1,Y_2,\cdots,Y_n$ 独立同分布于 $Ga(1/2,1/2)$ ，那么

$$
\sum_{i=1}^n Y_i \sim Ga(n/2,1/2).
$$

我们将 $Ga(n/2,1/2)$ 命名为自由度为 $n$ 的卡方分布，即 $\chi^2(n)$ 。于是，我们可以有以下定义。

卡方分布
: 设 $X_1,X_2,\cdots,X_n$ 独立同分布于标准正态分布 $N(0,1)$ ，则称

$$
\chi^2 = X_1^2 + X_2^2 + \cdots + X_n^2 = \sum_{i=1}^n X_i^2
$$

的分布为自由度为 $n$ 的 $\chi^2$ 分布，记为 $\chi^2 \sim \chi^2(n)$ 。

根据伽马分布的期望和方差公式，我们知道，如果 $\chi^2 \sim \chi^2(n)$ ，那么

$$
\begin{eqnarray*}
E(\chi^2) &=& n\\
\text{Var}(\chi^2) &=& 2n
\end{eqnarray*}
$$

以下两个分布是建立在卡方分布之上。
